tutorials/LES/3DChannel180/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sedFoam_rbgh;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         120;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   30;

purgeWrite      1;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep yes;

maxCo          0.1;

maxAlphaCo     0.1;

maxDeltaT      1e-2;

// Favre averaging section

favreAveraging     true;  // To enable Favre average mode keep it true or otherwise keep it false

StartAverageTime   30;  // Time from where you want to start averaging

favreAverage_fluid true;   // To save the Favre average files 
TKEbudgetLES_fluid true;   // Compute fluid phase TKE Budget
favreAverage_solid false;   // To save the Favre average files 
TKEbudgetLES_solid false;   // Compute solid phase TKE Budget

/*
functions
{
    fieldAverage1
    {
        type                fieldAverage;
        libs                (fieldFunctionObjects);
        timeStart           100;
        writeControl        writeTime;

        fields
        (
            U.b
            {
                mean        on;
                prime2Mean  on;
                base        time;
            }
        );
    }
}
*/

// ************************************************************************* //
